clc, clear  % 清空命令窗口、清除工作区变量
% rng('shuffle')  % 根据当前时间为随机数生成器提供种子（该行被注释）
rng(0)  % 固定随机数种子为 0 ，使得每次产生的随机数可重复 
p0 = 0; n = 10^8; tic
for i = 1:n  % 循环 n 次 
    x = randi([0,99],1,5);  % 生成一行五列、元素在 [0,99] 区间的随机整数 
    [f,g] = mengte(x);  % 调用 mengte 函数计算目标函数值 f 和约束条件 g 
    if all(g <= 0)
        if p0 < f
            x0 = x; p0 = f;
        end
    end
end

x0, p0, toc  % 计时结束
function [f,g]=mengte(x);  % 定义目标函数和约束条件，函数名为 mengte，输入参数为 x 
f = x(1)^2 + x(2)^2 + 3*x(3)^2 + 4*x(4)^2 + 2*x(5)^2 - 8*x(1) - 2*x(2) - 3*x(3) -...
x(4) - 2*x(5); 
g = [sum(x) - 400  % 约束条件 1：x 各元素之和减去 400 
    x(1) + 2*x(2) + 2*x(3) + x(4) + 6*x(5) - 800  % 约束条件 2 
    2*x(1) + x(2) + 6*x(3) - 200  % 约束条件 3 
    x(3) + x(4) + 5*x(5) - 200];  % 约束条件 4 
end